# VoltageTypes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..VoltageTypes Property
ElectricalSetting Class See Also
---
Get all voltage type definitions information of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VoltageTypeSet VoltageTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VoltageTypes As VoltageTypeSet
	Get
```

Visual C++
---
```text
public:
property VoltageTypeSet^ VoltageTypes {
	VoltageTypeSet^ get ();
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace